from sklearn.ensemble import RandomForestClassifier


#学历 0:大专 2:硕士 1:本科
#"年龄", "身高", "年收入", '学历'
X = [
        [25, 179, 15, 0],
        [33, 190, 19, 0],
        [28, 180, 18, 2],
        [25, 178, 18, 2],
        [46, 100, 100, 2],
        [40, 170, 170, 1],
        [34, 174, 20, 2],
        [36, 181, 55, 1],
        [35, 170, 25, 2],
        [30, 180, 35, 1],
        [28, 174, 30, 1],
        [29, 176, 36, 1],
]

#有否相亲 0:N 1:Y
y = [0, 1, 1, 1, 0, 0, 1, 0, 1, 1, 0, 1]

#现在我们把训练数据，和对应的分类放入分类器中进行训练
clf = RandomForestClassifier().fit(X, y)

#预测下面此人是否相亲
p = [[28, 180, 18, 2]]
print(clf.predict(p))
